



let arr = [1, 3, 5, 7, 9];

// For ... in
// تستخدم للحصول على المفاتيح (keys) الخاصة بالكائن (Object).
// لا يُفضل استخدامها مع المصفوفات أو الكائنات القابلة للتكرار لأنها تُرجع المفاتيح وليس القيم.
let obj = { 1: 'x', 5: 'y', 3: 'z' };
for (let x in obj) {
    console.log(x + ' is ' + obj[x]); // يطبع المفتاح والقيمة الخاصة به.
}

// For ... of
// تُستخدم للحصول على القيم مباشرة من الكائنات القابلة للتكرار (Iterables) مثل المصفوفات (Arrays) والخرائط (Maps) والمجموعات (Sets).
let map = new Map();

map.set('key1', 'val1'); // إضافة مفتاح وقيمة إلى الخريطة.
map.set('key2', 'val2');
map.set('key3', 'val3');

for (let x of map) {
    console.log(x); // يطبع كل زوج (مفتاح - قيمة) كمصفوفة.
}

/*
الفرق بين for...in و for...of:
1. for...in:
   - تُستخدم للحصول على المفاتيح فقط.
   - تُستخدم غالبًا مع الكائنات (Objects).
   - لا تُرجع القيم مباشرة.

2. for...of:
   - تُستخدم للحصول على القيم مباشرة.
   - تعمل مع الكائنات القابلة للتكرار مثل (Array, Map, Set).
   - لا تعمل مع الكائنات (Objects) إلا إذا كانت قابلة للتكرار باستخدام Symbol.iterator.
*/
